f9micro/f9-kernel/include/platform/stm32f1/registers.h
/* Flash Registers (FLASH) */
#define FLASH_ACR                         \
    (volatile uint32_t *) (FLASH_R_BASE + \
                           0x00) /* Flash Access Control Register */

/* Direct Memory Access  (DMA) */
#define DMA_LISR                                                             \
    (volatile uint32_t *) (DMA_BASE + 0x00) /* DMA interrupt status register \
                                             */
#define DMA_IFCR                      \
    (volatile uint32_t *) (DMA_BASE + \
                           0x04) /* DMA interrupt flag clear register */
/* Channel n */
#define DMA_CR_C(n)                          \
    (volatile uint32_t *) (DMA_BASE + 0x08 + \
                           (0x14 *           \
                            n)) /* DMA stream n configuration register */
#define DMA_NDTR_C(n)                        \
    (volatile uint32_t *) (DMA_BASE + 0x0C + \
                           (0x14 *           \
                            n)) /* DMA stream n number of data register */
#define DMA_PAR_C(n)                         \
    (volatile uint32_t *) (DMA_BASE + 0x10 + \
                           (0x14 *           \
                            n)) /* DMA stream n peripheral address register */
#define DMA_MAR_C(n)                         \
    (volatile uint32_t *) (DMA_BASE + 0x14 + \
                           (0x14 *           \
                            n)) /* DMA stream n memory 0 address register */

/**********************************************************************************************************************************************/

/* Bit Masks - See RM0090 Reference Manual for STM32F4 for details */

#define RCC_CR_HSION (uint32_t) (1 << 0)        /* HSI clock enable */
#define RCC_CR_HSIRDY (uint32_t) (1 << 1)       /* HSI ready */
#define RCC_CR_HSITRIM_M (uint32_t) (0xF8 << 0) /* HSI trimming mask */
#define RCC_CR_HSICAL_M (uint32_t) (0xFF << 8)  /* HSI calibration mask */
#define RCC_CR_HSEON (uint32_t) (1 << 16)       /* HSE clock enable */
#define RCC_CR_HSERDY (uint32_t) (1 << 17)      /* HSE ready */
#define RCC_CR_HSEBYP (uint32_t) (1 << 18)      /* HSE bypass */
#define RCC_CR_CSSON (uint32_t) (1 << 19)  /* Clock security system enable */
#define RCC_CR_PLLON (uint32_t) (1 << 24)  /* Main PLL enable */
#define RCC_CR_PLLRDY (uint32_t) (1 << 25) /* Main PLL clock ready */

#define RCC_CFGR_SW_M (uint32_t) (3 << 0) /* System clock switch mask */
#define RCC_CFGR_SW_HSI                                                       \
    (uint32_t) (0 << 0) /* System clock switch - HSI selected as system clock \
                         */
#define RCC_CFGR_SW_HSE                                                       \
    (uint32_t) (1 << 0) /* System clock switch - HSE selected as system clock \
                         */
#define RCC_CFGR_SW_PLL                                                       \
    (uint32_t) (2 << 0) /* System clock switch - PLL selected as system clock \
                         */
#define RCC_CFGR_SWS_M                                     \
    (uint32_t) (3 << 2) /* System clock switch status mask \
                         */
#define RCC_CFGR_SWS_HSI                                                   \
    (uint32_t) (0 << 2) /* System clock switch status - HSI used as system \
                           clock */
#define RCC_CFGR_SWS_HSE                                                   \
    (uint32_t) (1 << 2) /* System clock switch status - HSE used as system \
                           clock */
#define RCC_CFGR_SWS_PLL                                                   \
    (uint32_t) (2 << 2) /* System clock switch status - PLL used as system \
                           clock */
#define RCC_CFGR_HPRE_M (uint32_t) (0xF << 4) /* AHB prescaler mask */
#define RCC_CFGR_HPRE_DIV1 \
    (uint32_t) (0x0 << 4) /* AHB prescaler - SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2                            \
    (uint32_t) (0x8 << 4) /* AHB prescaler - SYSCLK/2 \
                           */
#define RCC_CFGR_HPRE_DIV4                            \
    (uint32_t) (0x9 << 4) /* AHB prescaler - SYSCLK/4 \
                           */
#define RCC_CFGR_HPRE_DIV8                            \
    (uint32_t) (0xA << 4) /* AHB prescaler - SYSCLK/8 \
                           */
#define RCC_CFGR_HPRE_DIV16 \
    (uint32_t) (0xB << 4) /* AHB prescaler - SYSCLK/16 */
#define RCC_CFGR_HPRE_DIV64 \
    (uint32_t) (0xC << 4) /* AHB prescaler - SYSCLK/64 */
#define RCC_CFGR_HPRE_DIV128 \
    (uint32_t) (0xD << 4) /* AHB prescaler - SYSCLK/128 */
#define RCC_CFGR_HPRE_DIV256 \
    (uint32_t) (0xE << 4) /* AHB prescaler - SYSCLK/256 */
#define RCC_CFGR_HPRE_DIV512 \
    (uint32_t) (0xF << 4) /* AHB prescaler - SYSCLK/512 */
#define RCC_CFGR_PPRE1_M \
    (uint32_t) (0x7 << 8) /* APB low speed prescaler mask */
#define RCC_CFGR_PPRE1_DIV1 \
    (uint32_t) (0x0 << 8) /* APB low speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE1_DIV2 \
    (uint32_t) (0x4 << 8) /* APB low speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE1_DIV4 \
    (uint32_t) (0x5 << 8) /* APB low speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE1_DIV8 \
    (uint32_t) (0x6 << 8) /* APB low speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE1_DIV16 \
    (uint32_t) (0x7 << 8) /* APB low speed prescaler - HCLK/16 */
#define RCC_CFGR_PPRE2_M \
    (uint32_t) (0x38 << 8) /* APB high speec prescaler mask */
#define RCC_CFGR_PPRE2_DIV1 \
    (uint32_t) (0x0 << 8) /* APB high speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE2_DIV2 \
    (uint32_t) (0x20 << 8) /* APB high speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE2_DIV4 \
    (uint32_t) (0x28 << 8) /* APB high speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE2_DIV8 \
    (uint32_t) (0x30 << 8) /* APB high speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE2_DIV16 \
    (uint32_t) (0x38 << 8) /* APB high speed prescaler - HCLK/16 */
#define RCC_CFGR_RTCPRE_M \
    (uint32_t) (0x1F << 16) /* HSE division factor for RTC clock mask */
#define RCC_CFGR_RTCPRE(n) \
    (uint32_t) (n << 16) /* HSE division factor for RTC clock */

