f9micro/f9-kernel/include/platform/stm32f1/registers.h
#define I2C_SR1_SB (uint32_t) (1 << 0)        /* I2C start bit generated */
#define I2C_SR1_ADDR (uint32_t) (1 << 1)      /* I2C address sent/matched */
#define I2C_SR1_BTF (uint32_t) (1 << 2)       /* I2C byte transfer finished */
#define I2C_SR1_ADD10 (uint32_t) (1 << 3)     /* I2C 10-bit header sent */
#define I2C_SR1_STOPF (uint32_t) (1 << 4)     /* I2C stop detection */
#define I2C_SR1_RXNE (uint32_t) (1 << 6)      /* I2C DR not empty */
#define I2C_SR1_TXE (uint32_t) (1 << 7)       /* I2C DR empty */
#define I2C_SR1_BERR (uint32_t) (1 << 8)      /* I2C bus error */
#define I2C_SR1_ARLO (uint32_t) (1 << 9)      /* I2C attribution lost */
#define I2C_SR1_AF (uint32_t) (1 << 10)       /* I2C acknowledge failure */
#define I2C_SR1_OVR (uint32_t) (1 << 11)      /* I2C overrun/underrun */
#define I2C_SR1_PECERR (uint32_t) (1 << 12)   /* I2C PEC error in reception */
#define I2C_SR1_TIMEOUT (uint32_t) (1 << 14)  /* I2C timeout or tlow error */
#define I2C_SR1_SMBALERT (uint32_t) (1 << 15) /* I2C SMBus alert */

#define I2C_SR2_MSL (uint32_t) (1 << 0)     /* I2C master/slave */
#define I2C_SR2_BUSY (uint32_t) (1 << 1)    /* I2C bus busy */
#define I2C_SR2_TRA (uint32_t) (1 << 2)     /* I2C transmitter/receiver */
#define I2C_SR2_GENCALL (uint32_t) (1 << 4) /* I2C general call address */
#define I2C_SR2_SMBDEFAULT \
    (uint32_t) (1 << 5) /* I2C SMBus device default address */
#define I2C_SR2_SMBHOST (uint32_t) (1 << 6) /* I2C SMBus host header */
#define I2C_SR2_DUALF (uint32_t) (1 << 7)   /* I2C dual flag */
#define I2C_SR2_PEC(r) \
    (uint32_t) (r >> 8) /* I2C packet error checking register */

#define I2C_CCR_CCR(n)                                                  \
    (uint32_t) (n & 0x0FFF)               /* I2C clock control register \
                                           */
#define I2C_CCR_DUTY (uint32_t) (1 << 14) /* I2C fast mode duty cycle */
#define I2C_CCR_FS (uint32_t) (1 << 15)   /* I2C master mode selection */

/* USART */
#define USART_SR_TC (uint32_t) (1 << 6) /* USART Transmission Complete */
#define USART_SR_RXNE \
    (uint32_t) (1 << 5) /* USART Read data register not empty */

/* USART_CR1 */
#define USART_CR1_OVER8 (uint32_t) (1 << 15) /* Oversampling mode */
#define USART_CR1_UE (uint32_t) (1 << 13)    /* USART Enable */
#define USART_CR1_M9                                         \
    (uint32_t) (1 << 12) /* World length 1: 9 bits, 0: 8bits \
                          */
#define USART_CR1_WAKE (uint32_t) (1 << 11) /* Wakeup method */
#define USART_CR1_PCE (uint32_t) (1 << 10)  /* PCE Parity control enable */
#define USART_CR1_PS (uint32_t) (1 << 9)    /* Parity selection */
#define USART_CR1_PEIE (uint32_t) (1 << 8)  /* PE Interrupt enable */
#define USART_CR1_TXEIE (uint32_t) (1 << 7) /* TXE interrupt enable */
#define USART_CR1_TCIE \
    (uint32_t) (1 << 6) /* Transmission complete interrupt enable */
#define USART_CR1_RXNEIE (uint32_t) (1 << 5) /* RXNE Interrupt Enable */
#define USART_CR1_IDLEIE (uint32_t) (1 << 4) /* IDEL INterrupt Enable */
#define USART_CR1_TE (uint32_t) (1 << 3)     /* USART Transmit Enable */
#define USART_CR1_RE (uint32_t) (1 << 2)     /* USART Receive Enable */
#define USART_CR1_RWU (uint32_t) (1 << 1)
#define USART_CR1_SBK (uint32_t) (1 << 0) /* Send break characters */

#define USART_CR3_DMAR_EN (uint32_t) (1 << 6) /* USART DMA Receive Enable */
#define USART_CR3_DMAT_EN (uint32_t) (1 << 7) /* USART DMA Transmit Enable */

/* GPIO */
#define GPIOA (uint8_t) (0) /* GPIO Port A */
#define GPIOB (uint8_t) (1) /* GPIO Port B */
#define GPIOC (uint8_t) (2) /* GPIO Port C */
#define GPIOD (uint8_t) (3) /* GPIO Port D */
#define GPIOE (uint8_t) (4) /* GPIO Port E */

#define GPIO_CR_PIN(n) (uint32_t) (4 * n)      /* Pin bitshift */
#define GPIO_CR_M(n) (uint32_t) (0x3 << 4 * n) /* Pin mask */

#define GPIO_OSPEED_10M (uint32_t) (0x1) /* Output speed 10MHz */
#define GPIO_OSPEED_2M (uint32_t) (0x2)  /* Output speed 2MHz */
#define GPIO_OSPEED_50M (uint32_t) (0x3) /* Output speed 50MHz */

#define GPIO_MODE_IN_ANALOG (uint32_t) (0x00) /* Input analog mode */
#define GPIO_MODE_IN_FLOAT (uint32_t) (0x01)  /* Input floating point mode */
#define GPIO_MODE_IN_PD (uint32_t) (0x0A)     /* Input push down mode */
#define GPIO_MODE_IN_PU (uint32_t) (0x12)     /* Input pull up mode */
#define GPIO_MODE_OUT_PP (uint32_t) (0x04)    /* Output push-pull mode */
#define GPIO_MODE_OUT_OD (uint32_t) (0x05)    /* Output open-drain mode */
#define GPIO_MODE_OUT_ALT_PP \
    (uint32_t) (0x06) /* Output alternate function push-pull mode */
#define GPIO_MODE_OUT_ALT_OD \
    (uint32_t) (0x07) /* Output alternate function open-drain mode */

#define GPIO_IDR_PIN(n) (uint32_t) (1 << n) /* Input for pin n */

#define GPIO_ODR_PIN(n) (uint32_t) (1 << n) /* Output for pin n */

#define GPIO_BSRR_BS(n) (uint32_t) (1 << n)        /* Set pin n */
#define GPIO_BSRR_BR(n) (uint32_t) (1 << (n + 16)) /* Reset pin n */
#define GPIO_BRR_BR(n) (uint16_t) (1 << n)         /* Reset pin n */
#define GPIO_LCKR_LCK(n) (uint32_t) (1 << n)       /* Lock pin n */

/* DMA */
#define DMA_ISR_GIF(n)                                                       \
    (uint32_t) (0x1 << ((n - 1) * 4)) /* DMA Channel n Global interrupt flag \
                                       */
#define DMA_ISR_TCIF(n)                                                       \
    (uint32_t) (0x2 << ((n - 1) * 4)) /* DMA Channel n Transfer Complete flag \
                                       */
#define DMA_ISR_HTIF(n) \
    (uint32_t) (0x4 << ((n - 1) * 4)) /* DMA Channel n Half Transfer flag */
#define DMA_ISR_TEIF(n) \
    (uint32_t) (0x8 << ((n - 1) * 4)) /* DMA Channel n Transfer Error flag */

#define DMA_IFCR_CGIF(n)                                                      \
    (uint32_t) (0x1 << ((n - 1) * 4)) /* DMA Channel n Global interrupt clear \
                                       */
#define DMA_IFCR_CTCIF(n)         \
    (uint32_t) (0x2 << ((n - 1) * \
                        4)) /* DMA Channel n Transfer Complete clear */
#define DMA_IFCR_CHTIF(n) \
    (uint32_t) (0x4 << ((n - 1) * 4)) /* DMA Channel n Half Transfer clear */
#define DMA_IFCR_CTEIF(n) \
    (uint32_t) (0x8 << ((n - 1) * 4)) /* DMA Channel n Transfer Error clear */

#define DMA_CCR_EN (uint16_t) (1 << 0) /* DMA Channel enable */
#define DMA_CCR_TCIE \
    (uint16_t) (1 << 1) /* DMA Channel transfer complete interrupt enable */
#define DMA_CCR_HTIE \
    (uint16_t) (1 << 2) /* DMA Channel half transfer interrupt enable */
#define DMA_CCR_TEIE                                                         \
    (uint16_t) (1 << 3) /* DMA Channel transfer error interrupt error enable \
                         */
#define DMA_CCR_DIR \
    (uint16_t) (1 << 4) /* DMA Channel data transfer direction */
#define DMA_CCR_CIRC (uint16_t) (1 << 5) /* DMA Channel circular mode */
#define DMA_CCR_PINC \
    (uint16_t) (1 << 6) /* DMA Channel peripheral increment mode */
#define DMA_CCR_MINC                                                         \
    (uint16_t) (1 << 7)                 /* DMA Channel Memory increment mode \
                                         */
#define DMA_CCR_PL (uint16_t) (3 << 12) /* DMA Channel Priority level mask */
#define DMA_CCR_MEM2MEM \
    (uint16_t) (1 << 14) /* DMA Channel Memory to memory mode */

#endif
